In [25]:
import numpy
import pandas as pd

In [2]:
palette = {1:"blue", 2:"black", 5:"green"}
palette[1] = "brown"

In [17]:
movies = {
    'Title': ['Collide', 'The Heartbreak Kid', 'American Pastoral', 'Goosebumps', 'Australia', 'Les Misérables', 'The Illusionist', 'The Big Short'],
    'Year': [2016, 2007, 2016, 2015, 2008, 2012, 2006, 2015],
    'Rating': [5.7, 5.8, 6.1, 6.3, 6.6, 7.6, 7.6, 7.8],
    'Metascore': [33.0, 46.0, np.nan, 60.0, 53.0, 63.0, 68.0, 81.0]
}

df = pd.DataFrame(movies)

In [16]:
scores = (10, 19, 14, 17, 18, 19)

In [23]:
df.loc[-2:]

                Title  Year  Rating  Metascore
0             Collide  2016     5.7       33.0
1  The Heartbreak Kid  2007     5.8       46.0
2   American Pastoral  2016     6.1        NaN
3          Goosebumps  2015     6.3       60.0
4           Australia  2008     6.6       53.0
5      Les Misérables  2012     7.6       63.0
6     The Illusionist  2006     7.6       68.0
7       The Big Short  2015     7.8       81.0

In [26]:
people = pd.DataFrame([['male', 25.0, 'Third'],
       ['female', numpy.nan, 'Third'],
       ['male', 36.0, 'Second'],
       ['male', 47.0, 'First'],
       ['male', numpy.nan, 'Third'],
       ['female', 7.0, 'Second'],
       ['male', numpy.nan, 'Third'],
       ['male', 23.0, 'Second']], columns = ["sex", "age","class"])

In [28]:
people["age"].mean()

np.float64(27.6)

In [29]:
people["age"] = people["age"].fillna(people["age"].mean())

In [30]:
people

      sex   age   class
0    male  25.0   Third
1  female  27.6   Third
2    male  36.0  Second
3    male  47.0   First
4    male  27.6   Third
5  female   7.0  Second
6    male  27.6   Third
7    male  23.0  Second

In [31]:
data = [['man', 'Third', 25.0],
       ['man', 'First', 27.0],
       ['child', 'First', 0.92],
       ['child', 'Second', 3.0],
       ['man', 'First', 52.0],
       ['woman', 'First', 31.0],
       ['woman', 'First', 43.0],
       ['woman', 'First', 30.0],
       ['man', 'First', 36.0],
       ['man', 'First', 40.0]]
people = pd.DataFrame(data, columns=["who", "class", "age"])

In [40]:
people.pivot_table(index="who", columns= "class", values="age", aggfunc="mean")

class      First  Second  Third
who
child   0.920000     3.0    NaN
man    38.750000     NaN   25.0
woman  34.666667     NaN    NaN

In [59]:
people = pd.DataFrame([['female', 26.0],
       ['female', 22.0],
       ['female', 18.0],
       ['male', 36.5],
       ['male', 24.0],
       ['male', 17.0],
       ['female', 17.0]],
       index = [ 148, 578, 786, 19, 499, 721, 307], columns = ["sex","age"])

In [60]:
people_sorted = people.sort_values(by="age", ascending=True)

In [61]:
people_sorted = people_sorted.reset_index()

In [62]:
people_sorted

   index     sex   age
0    307  female  17.0
1    721    male  17.0
2    786  female  18.0
3    578  female  22.0
4    499    male  24.0
5    148  female  26.0
6     19    male  36.5

In [80]:
data1 = pd.DataFrame([['female', 'Second', 29.0],
       ['male', 'First', 27.0],
       ['male', 'Third', 6.0]], columns = ["sex", "class", "age"])
data2 = pd.DataFrame([['female', 'First', 63.0, 77.9583],
       ['male', 'Second', 1.0, 39.0],
       ['male', 'First', 31.0, 57.0],
       ['female', 'Second', 57.0, 10.5]], columns = ["sex", "class", "age", "fare"])

In [85]:
pd.concat([data1, data2], ignore_index=True, join="inner")

      sex   class   age
0  female  Second  29.0
1    male   First  27.0
2    male   Third   6.0
3  female   First  63.0
4    male  Second   1.0
5    male   First  31.0
6  female  Second  57.0

In [86]:
data1 = pd.DataFrame([['female', 'First', 63.0, 77.9583],
       ['male', 'Second', 1.0, 39.0],
       ['male', 'First', 31.0, 57.0],
       ['female', 'Second', 57.0, 10.5]], columns = ["sex", "class", "age", "fare"])
data2 = pd.DataFrame([['female', 'Second', 29.0],
       ['male', 'First', 27.0],
       ['male', 'Third', 6.0]], columns = ["sex", "class", "age"])

In [87]:
pd.concat([data1, data2], ignore_index=True)

      sex   class   age     fare
0  female   First  63.0  77.9583
1    male  Second   1.0  39.0000
2    male   First  31.0  57.0000
3  female  Second  57.0  10.5000
4  female  Second  29.0      NaN
5    male   First  27.0      NaN
6    male   Third   6.0      NaN

In [94]:
data = [['Adelie', 4300.0, 'Dream'],
       ['Adelie', 3800.0, 'Torgersen'],
       ['Chinstrap', 4450.0, 'Dream'],
       ['Adelie', 3275.0, 'Torgersen'],
       ['Gentoo', 4875.0, 'Biscoe'],
       ['Gentoo', 5250.0, 'Biscoe'],
       ['Gentoo', 5700.0, 'Biscoe'],
       ['Chinstrap', 4100.0, 'Dream'],
       ['Gentoo', 4600.0, 'Biscoe'],
       ['Adelie', 4100.0, 'Dream']]
penguins = pd.DataFrame(data, columns=["species", "body_mass", "island"])

In [95]:
new_penguins = penguins["body_mass"] = penguins["body_mass"] / 1000

In [97]:
import pandas as pd
people = pd.DataFrame([[19, 'female', numpy.nan],
       [148, 'male', 36.5],
       [578, 'female', numpy.nan],
       [786, 'female', 18.0],
       [499, 'male', 24.0],
       [721, 'male', 17.0],
       [307, 'female', 17.0]], columns = ["id", "sex","age"])

In [98]:
people.set_index("id")

        sex   age
id
19   female   NaN
148    male  36.5
578  female   NaN
786  female  18.0
499    male  24.0
721    male  17.0
307  female  17.0

In [100]:
people = pd.DataFrame([['male', 25.0, 'Third'],
       ['female', numpy.nan, 'Third'],
       ['male', 36.0, 'Second'],
       ['male', 47.0, 'First'],
       ['male', numpy.nan, 'Third'],
       ['male', 7.0, 'Third'],
       ['female', 17.0, 'First'],
       ['female', 7.0, 'Second'],
       ['male', numpy.nan, 'Third'],
       ['male', 23.0, 'Second']], columns = ["sex", "age","class"])

In [101]:
people.dropna()

      sex   age   class
0    male  25.0   Third
2    male  36.0  Second
3    male  47.0   First
5    male   7.0   Third
6  female  17.0   First
7  female   7.0  Second
9    male  23.0  Second

In [102]:
data = pd.DataFrame([['Escape Plan', 'Action,Crime,Mystery', 2013],
       ['Mr. Right', 'Action,Comedy,Romance', 2015],
       ['District 9', 'Action,Sci-Fi,Thriller', 2009],
       ["Don't Breathe", 'Crime,Horror,Thriller', 2016],
       ['The Family', 'Comedy,Crime,Thriller', 2013],
       ['Wrecker', 'Action,Horror,Thriller', 2015]],
        columns = ["Title","Genre", "Year"])

In [103]:
data['Genre'].str.split(",")

0      [Action, Crime, Mystery]
1     [Action, Comedy, Romance]
2    [Action, Sci-Fi, Thriller]
3     [Crime, Horror, Thriller]
4     [Comedy, Crime, Thriller]
5    [Action, Horror, Thriller]
Name: Genre, dtype: object

In [105]:
genre_count = data['Genre'].str.split(",").explode()
genre_count = genre_count.value_counts()

In [106]:
genre_count

Genre
Action      4
Thriller    4
Crime       3
Comedy      2
Horror      2
Mystery     1
Sci-Fi      1
Romance     1
Name: count, dtype: int64

In [107]:
data = [['Adelie', 4300.0, 'Dream'],
       ['Adelie', 3800.0, 'Torgersen'],
       ['Chinstrap', 4450.0, 'Dream'],
       ['Adelie', 3275.0, 'Torgersen'],
       ['Gentoo', 4875.0, 'Biscoe'],
       ['Gentoo', 5250.0, 'Biscoe'],
       ['Gentoo', 5700.0, 'Biscoe'],
       ['Chinstrap', 4100.0, 'Dream'],
       ['Gentoo', 4600.0, 'Biscoe'],
       ['Adelie', 4100.0, 'Dream']]
penguins = pd.DataFrame(data, columns=["species", "body_mass", "island"])